#language: ru

@tree

Функционал: Расчет суммы документа Заказ при изменении количества и цены

Как Менеджер по продажам я хочу
изменить количество и цену в Заказе 
чтобы убедиться, что расчет суммы документа будет правильным   

Контекст:
	Дано Я запускаю сценарий открытия TestClient или подключаю уже существующий

Сценарий: создание документа Заказ
// Создание документа и отображение в Справочнике "Заказы товаров"
* Открытие формы создания документа Заказ 
	И я закрываю все окна клиентского приложения
	И В командном интерфейсе я выбираю "Продажи" "Заказы"
	Тогда открылось окно "Заказы товаров"
	И я нажимаю на кнопку с именем 'ФормаСоздать'
	Тогда открылось окно "Заказ (создание)"
* Заполнение шапки документа
	И из выпадающего списка с именем 'Организация' я выбираю точное значение 'ООО "Все для дома"'
	И из выпадающего списка с именем 'Покупатель' я выбираю точное значение 'Магазин "Бытовая техника"'
	И из выпадающего списка с именем 'Склад' я выбираю точное значение "Склад отдела продаж"
	И из выпадающего списка с именем 'Валюта' я выбираю точное значение "Рубли"
* Заполнение товарной части
	И в таблице 'Товары' я нажимаю на кнопку с именем 'ТоварыДобавить'
	И в таблице 'Товары' я нажимаю кнопку выбора у реквизита с именем 'ТоварыТовар'
	Тогда открылось окно "Товары"
	И в таблице 'Список' я разворачиваю строку:
		| "Код"       | "Наименование"  |
		| "000000012" | "Электротовары" |
	И в таблице 'Список' я разворачиваю строку:
		| "Код"       | "Наименование" |
		| "000000014" | "Пылесосы"     |
	И в таблице 'Список' я перехожу к строке:
		| "Код"       | "Наименование" |
		| "000000015" | "Вихрь"        |
	И в таблице 'Список' я выбираю текущую строку
	Тогда открылось окно "Заказ (создание) *"
	И в таблице 'Товары' из выпадающего списка с именем 'ТоварыТовар' я выбираю точное значение "Вихрь"
	И в таблице 'Товары' я завершаю редактирование строки
	И я нажимаю на кнопку "Записать"
* Номер
	И я запоминаю значение поля "Номер" как "$Номер$"	
* Проведение документа
	И я нажимаю на кнопку с именем 'ФормаПровестиИЗакрыть'
	И я жду закрытия окна "Заказ (создание) *" в течение 10 секунд

// Ожидаемый результат
* Ожидаемый результат: создался документ Заказ
	И таблица "Список" содержит строки:
		| 'Номер'   |
		| '$Номер$' |

Сценарий: расчет суммы документа Заказ при изменении количества
* Открытие документа Заказ
	И В командном интерфейсе я выбираю "Продажи" "Заказы"
	Тогда открылось окно "Заказы товаров"
	И в таблице 'Список' я активизирую поле с именем 'Номер'
	И в таблице 'Список' я выбираю текущую строку
	Тогда открылось окно "Заказ * от *"
* Изменение количества
	И в таблице 'Товары' я активизирую поле с именем 'ТоварыКоличество'
	И в таблице 'Товары' я выбираю текущую строку
	И в таблице 'Товары' в поле с именем 'ТоварыКоличество' я ввожу текст "2"
	И в таблице 'Товары' я завершаю редактирование строки

// Ожидаемый результат
* Ожидаемый результат: сумма заказа с измененным количеством рассчитана корректно
	Тогда таблица 'Товары' стала равной:
		| 'Товар' | 'Цена'     | 'Количество' | 'Сумма'     |
		| 'Вихрь' | '7 000,00' | '2'          | '14 000,00' |

Сценарий: расчет суммы документа Заказ при изменении цены
* Открытие документа Заказ
	И В командном интерфейсе я выбираю "Продажи" "Заказы"
	Тогда открылось окно "Заказы товаров"
	И в таблице 'Список' я активизирую поле с именем 'Покупатель'
	И в таблице 'Список' я выбираю текущую строку
	Тогда открылось окно "Заказ * от *"
* Изменение цены
	И в таблице 'Товары' я активизирую поле с именем 'ТоварыЦена'
	И в таблице 'Товары' я выбираю текущую строку
	И в таблице 'Товары' в поле с именем 'ТоварыЦена' я ввожу текст "8 000,00"
	И в таблице 'Товары' я завершаю редактирование строки

// Ожидаемый результат
* Ожидаемый результат: сумма заказа измененной ценой рассчитана корректно
	Тогда таблица 'Товары' стала равной:
		| 'Товар' | 'Цена'     | 'Количество' | 'Сумма'     |
		| 'Вихрь' | '8 000,00' | '1'          | '8 000,00' |
